---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetPropertyEnum.Value
source: html/9fa29f76-4c64-cdde-2dee-77d3f2276ad1.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyEnum.Value Property

The value of the property.

## Syntax (C#)
```csharp
public int Value { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input value is invalid for this AssetPropertyEnum property.
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The asset property is not editable.